Repository: meksym/todo
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: uk

source: How it works❓
uk: Як це працює❓

source: 📝 To-do list
uk: 📝 Завдання

source: 🆕 Create task
uk: 🆕 Створити завдання

source: ⚙️ Settings
uk: ⚙️ Налаштування

source: 📁 Folders
uk: 📁 Папки

source: Sorry, but I couldn't find the specified task.
uk: Вибачте, але я не зміг знайти вказане завдання.

source: ✅ YES
uk: ✅ ТАК

source: ❌ NO
uk: ❌ НІ

source: Do I need to create tasks?
uk: Мені потрібно створити завдання?

source: Name: %s
uk: Назва: %s

source: Description: %s
uk: Опис: %s

source: Can't process it. Invalid data received.
uk: Неможливо обробити. Отримано недійсні дані.

source: Sorry, I can't register this entry for the task "%s" because there's already another one intersecting with it – its start %s (duration %s)
uk: На жаль, я не можу зареєструвати цей запис для завдання "%s", тому що з ним уже перетинається інше – його початок %s (тривалість %s)

source: Reminder
uk: Нагадування

source: 🇬🇧 English
uk: 🇬🇧 Англійська

source: 🇺🇦 Ukrainian
uk: 🇺🇦 Українська

source: Sorry, but I can't show the folders because you don't have them.
uk: Вибачте, але я не можу показати папки, тому що у вас їх немає.

source: 🆕 Create folder
uk: 🆕 Створити папку

source: Main folder
uk: Головна папка

source: ⬅️ Previous page
uk: ⬅️ Попередня сторінка

source: ➡️ Next page
uk: ➡️ Наступна сторінка

source: 🆕 Create new
uk: 🆕 Створити нову

source: Below is a list of your folders. To change the folder, click on the corresponding number.
uk: Нижче наведено список ваших папок. Щоб змінити папку, натисніть на відповідний номер.

source: ⬅️ Cancel
uk: ⬅️ Відмінити

source: Creating a new folder. You need to enter a name, and if necessary, you can enter a description on the next line.
uk: Створення нової папки. Потрібно ввести ім’я, а за потреби можна ввести опис у наступному рядку.

source: Sorry, but I can't process it. Try again.
uk: Вибачте, але я не можу це обробити. Спробуйте знову.

source: Folder "%s" has been created. Type /%s to view the list of folders.
uk: Папку "%s" створено. Введіть /%s, щоб переглянути список папок.

source: Folder does not exists
uk: Папки не існує

source: This is the main folder that always exists by default and cannot be deleted or edited.
uk: Це основна папка, яка завжди існує за замовчуванням і не може бути видалена чи відредагована.

source: 🟢 Set as active
uk: 🟢 Встановити активною

source: 🔄 Update details
uk: 🔄 Оновити

source: ❌ Delete
uk: ❌ Видалити

source: Folder: {name} {description}
uk: Папка: {name} {description}

source: Folder: %s
uk: Папка: %s

source: Active folder successfully changed. Now active folder is "%s"
uk: Активну папку успішно змінено. Зараз активною є "%s"

source: Sorry, but you cannot change the data of the main folder.
uk: Вибачте, але ви не можете змінити дані головної папки.

source: To change the "%s" folder, you need to send me a new name and if necessary a description via line
uk: Щоб змінити папку "%s", вам потрібно надіслати мені нове ім'я та, якщо необхідно, опис через рядок

source: Folder does not exist
uk: Папки не існує

source: Folder "%s" successfully changed. Type /%s to view the list of folders.
uk: Папку "%s" успішно змінено. Введіть /%s, щоб переглянути список папок.

source: Sorry, but you cannot delete the main folder.
uk: Вибачте, але Ви не можете видалити головну папку.

source: ❌ Confirm deletion
uk: ❌ Підтвердити видалення

source: Are you sure you want to delete this folder? If you delete it, all its contents will also be deleted.
uk: Ви впевнені, що хочете видалити цю папку? Якщо ви видалите, весь її вміст також буде видалено.

source: Folder "%s" was successfully deleted
uk: Папку "%s" учпішно видалено

source: There is no incomplete task in the folder "%s". Create a new one if necessary.
uk: У папці "%s" немає невиконаного завдання. За потреби створіть новий.

source: 🕰️📈 Reports
uk: 🕰️📈 Звіти

source: Below is the list of your unfinished tasks in the folder "%s". To make changes to a task, click on the corresponding number.
uk: Нижче наведено список ваших незавершених завдань у папці "%s". Щоб внести зміни в завдання, натисніть на відповідний номер.

source: Sorry, but I can't process it because the page is wrong. ):
uk: Вибачте, але я не можу це обробити, оскільки номер сторінки неправильний. ):

source: To create a new task, send me its name and, if necessary, its description via a line.
uk: Щоб створити нове завдання, надішліть мені його назву та, якщо необхідно, опис через рядок.

source: Task "%s" successfully created.
uk: Завдання "%s" успішно створено.

source: Your task from the folder "%s"
uk: Ваше завдання з папки "%s"

source: Created by: %s
uk: Створено: %s

source: ✅ Mark done
uk: ✅ Відмітити виконаним

source: 🔄 Update
uk: 🔄 Оновити

source: 📁 Active folder
uk: 📁 Активна папка

source: ❌ Remove
uk: ❌ Видалити

source: ⏲️ Countdown
uk: ⏲️ Відлік

source: 🔔 Reminder
uk: 🔔 Нагадування

source: The task "%s" has been successfully marked as completed.
uk: Завдання "%s" успішно відмічено виконаним

source: To update the details of the task "%s" send me a new name and if necessary a new description.
uk: Щоб оновити деталі завдання "%s", надішліть мені нову назву та, якщо необхідно, новий опис.

source: Cencel
uk: Відмінити

source: Update task does not exist ):
uk: Завдання не існує

source: Task "%s" successfully updated.
uk: Завдання "%s" успішно оновлено.

source: Are you sure you want to delete task "%s"?
uk: Ви впевнені, що хочете видалити завдання "%s"?

source: Task "%s" successfully deleted!
uk: Завдання "%s" успішно видалено!

source: ⏰ Complete the countdown
uk: ⏰ Завершити відлік

source: ❌ Cancel
uk: ❌ Відмінити

source: The countdown for the task "%s" has started (%s). To complete it, please press the corresponding "⏰ Complete the countdown" button.
uk: Зворотний відлік для завдання "%s" розпочато (%s). Щоб завершити, натисніть відповідну кнопку "⏰ Завершити відлік".

source: Button with incorrect data :(
uk: Кнопка з не коректною інформацією

source: ✅YES
uk: ✅ ТАК

source: ❌ REMOVE
uk: ❌ ВИДАЛИТИ

source: Would you like to record the execution time (start: %s, duration: %s) for the task "%s"? If yes, please click the corresponding button or send any message with the text – it will be automatically added as a note to this record. If not, simply click the corresponding button.
uk: Бажаєте записати час виконання (початок: %s, тривалість: %s) для завдання "%s"? Якщо так, натисніть відповідну кнопку або надішліть будь-яке повідомлення з текстом – воно буде автоматично додано як примітку до цього запису. Якщо ні, просто натисніть відповідну кнопку.

source: Sorry, something unexpected happened. I can't process it.
uk: Вибачте, сталося щось несподіване. Я не можу це обробити.

source: The time record for the task "%s" has been successfully created.
uk: Запис часу для завдання "%s" успішно створено.

source: Activity reports for the task "%s". To receive the report, please click the button for the desired period.
uk: Звіти про діяльність для завдання "%s". Щоб отримати звіт, натисніть кнопку для потрібного періоду.

source: Sorry, but there is not enough data to generate the report. Please use the countdown and try again later.
uk: Вибачте, але недостатньо даних для створення звіту. Скористайтеся зворотним відліком і повторіть спробу пізніше.

source: The sent photo contains today's activity report for the task "%s".
uk: Надіслана фотографія містить сьогоднішній звіт про діяльність для завдання "%s".

source: The sent photo contains the activity report for the task "%s" for the last 7 days.
uk: Надіслана фотографія містить звіт активності для завдання "%s" за останні 7 днів.

source: The sent photo contains the activity report for the task "%s" for the last 30 days.
uk: Надіслана фотографія містить звіт активності для завдання "%s" за останні 30 днів.

source: Activity reports for tasks from the "%s" folder. To obtain a report, select the desired period and click the corresponding button.
uk: Звіти про дії для завдань із папки "%s". Щоб отримати звіт, виберіть потрібний період і натисніть відповідну кнопку.

source: The attached photo contains an activity report for tasks in the "%s" folder
uk: Додана фотографія містить звіт про діяльність для завдань у папці "%s".

source: Cancel
uk: Відмінити

source: To set a reminder, enter the date and time in the following format:
uk: Щоб встановити нагадування, введіть дату й час у такому форматі:

source: Y — year (four digits)
uk: Y — рік (4 цифри)

source: m — month (two digits)
uk: m — місяць (2 цифри)

source: d — day (two digits)
uk: d — день (2 цифри)

source: H — hour (24-hour format, two digits)
uk: H — години (24-годинний формат, дві цифри)

source: M — minutes (two digits)
uk: M — хвилини (2 цифри)

source: Please note that the reminder will be created according to your time zone.
uk: Зверніть увагу, що нагадування буде створено відповідно до вашого часового поясу.

source: Sorry, but I can't process it. Please try again.
uk: Вибачте, але я не можу це обробити. Будь ласка спробуйте ще раз.

source: The entered time is not valid
uk: Введений час недійсний

source: Sorry, but something went wrong. Please try again.
uk: Вибачте, але щось пішло не так. Будь ласка спробуйте ще раз.

source: Reminder successfully created
uk: Нагадування успішно створено

source: Hello!
uk: Привіт!

source: This is a personal management tool that will help you better manage your time, set goals, and track progress. You can work with tasks and, if necessary, use the task grouping feature to better organize your activities. You can also create reminders for tasks at specified times. Additionally, there is an extra feature for tracking your productivity – timers and reports. You can use timers to record the time spent on tasks, and based on this data, you can generate a report – an image with a histogram. This tool will help you plan your day more effectively, stay organized, and achieve your goals.
uk: Це особистий інструмент управління, який допоможе вам краще керувати своїм часом, ставити цілі та відстежувати прогрес. Ви можете працювати із завданнями та при необхідності використовувати можливість групування завдань, що дозволить краще організувати ваші справи. Також ви можете створювати нагадування про завдання на визначений час. Крім цього, є додаткова можливість для відстеження вашої продуктивності – таймери та звіти. Ви можете використовувати таймери, які записуватимуть час виконання завдань, а на основі цих даних ви зможете отримати звіт – зображення з гістограмою. Цей інструмент допоможе вам ефективніше планувати свій день, залишатися організованим і досягати своїх цілей.

source: Сancelled
uk: Відмінено

source: Your settings Current language: %s Time zone: %s
uk: Ваші налаштування Поточна мова: %s Часова зона: %s

source: 🌐 Change language
uk: 🌐 Змінити мову

source: 🌍 Change time zone
uk: 🌍 Змінити часовий зону

source: Active folder: %s
uk: Активна папка: %s

source: 📁 Create folder
uk: 📁 Створити папку

source: You have %s tasks, %s of which are completed!
uk: Кількість ваших завдань %s, з яких виконано %s!

source: You have %s folders!
uk: Кількість ваших папок %s!

source: ⚙️ Back to settings
uk: ⚙️ Повернутися до налаштувань

source: Choose a language
uk: Обріть мову

source: Language successfully changed.
uk: Мова успішно змінена.

source: I can't set this language.
uk: Я не можу встановити цю мову.

source: To update the time zone, you need to send it to me in the correct format. Below is the link to the list (TZ identifier) of possible options.
uk: Щоб оновити часовий пояс, потрібно надіслати його мені в правильному форматі. Нижче посилання на список (ідентифікатор TZ) можливих варіантів.

source: Link
uk: Посилання

source: Send me your preferred time zone
uk: Надішліть мені бажаний часовий пояс

source: Sorry, but this time zone is not valid. Please try again.
uk: Вибачте, але цей часовий пояс недійсний. Будь ласка спробуйте ще раз.

source: Time zone successfully changed.
uk: Часовий пояс успішно змінено.

source: Activity time
uk: Час активності

source: Hour
uk: Година

source: Minute
uk: Хвилина

source: Day
uk: День

source: Hours
uk: Години
